target/classes/wsframework/FrameworkSeguridadSinSeg_1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<WL5G3N0:definitions name="FrameworkMediator" targetNamespace="http://xmlns.oracle.com/SCA_BloqueoLoginUsuario/FrameworkSeguridad/FrameworkMediator" xmlns:WL5G3N0="http://schemas.xmlsoap.org/wsdl/" xmlns:WL5G3N1="http://www.bolivariano.com/FrameworkSeguridadTypes" xmlns:WL5G3N2="http://www.bolivariano.com/MensajesFramework" xmlns:WL5G3N3="http://xmlns.oracle.com/SCA_BloqueoLoginUsuario/FrameworkSeguridad/FrameworkMediator" xmlns:WL5G3N4="http://schemas.xmlsoap.org/wsdl/soap/">
  <WL5G3N0:types>
    <xsd:schema xmlns:WL5G3N2="http://xmlns.oracle.com/SCA_BloqueoLoginUsuario/FrameworkSeguridad/FrameworkMediator" xmlns:WL5G3N3="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:frm="http://www.bolivariano.com/MensajesFramework" xmlns:p="http://www.w3.org/2001/XMLSchema" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      
      <xsd:import namespace="http://www.bolivariano.com/FrameworkSeguridadTypes" schemaLocation="FrameworkSeguridadSinSeg_1_2_3_4.xsd"/>
    </xsd:schema>
  </WL5G3N0:types>
  <WL5G3N0:message name="requestMessage">
    <WL5G3N0:part element="WL5G3N1:LoginAplicacion_in" name="blrequest"/>
  </WL5G3N0:message>
  <WL5G3N0:message name="replyMessage">
    <WL5G3N0:part element="WL5G3N1:LoginAplicacion_out" name="reply"/>
  </WL5G3N0:message>
 
  <WL5G3N0:portType name="Framework_ptt">
    <WL5G3N0:operation name="loginAplicacion">
      <WL5G3N0:input message="WL5G3N3:requestMessage"/>
      <WL5G3N0:output message="WL5G3N3:replyMessage"/>
    </WL5G3N0:operation>
  </WL5G3N0:portType>
  <WL5G3N0:binding name="Framework_pttBinding"
  	type="WL5G3N3:Framework_ptt">
  	<WL5G3N4:binding style="document"
  		transport="http://schemas.xmlsoap.org/soap/http" />
  	<WL5G3N0:operation name="loginAplicacion">
  		<WL5G3N4:operation
  			soapAction="http://xmlns.oracle.com/SCA_BloqueoLoginUsuario/FrameworkSeguridad/FrameworkMediator/loginAplicacion" />
  		<WL5G3N0:input>
  			<WL5G3N4:body use="literal" />
  		</WL5G3N0:input>
  		<WL5G3N0:output>
  			<WL5G3N4:body use="literal" />
  		</WL5G3N0:output>
  	</WL5G3N0:operation>
  </WL5G3N0:binding>
  <WL5G3N0:service name="FrameworkMediator_ep">
    <WL5G3N0:port binding="WL5G3N3:Framework_pttBinding" name="Framework_pt">
      <WL5G3N4:address location="https://soavides.bolivariano.fin.ec:5554/FrameworkSeguridad/proxy/FrameworkSeguridadSinSeg"/>
    </WL5G3N0:port>
  </WL5G3N0:service>
</WL5G3N0:definitions>