UTILIDAD/VIA RAPIDA/FRAMEWORK_SEGURIDAD/WSDL.txt

https://soavides.bolivariano.fin.ec:5554/FrameworkSeguridad/proxy/FrameworkSeguridad?wsdl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fram="http://www.bolivariano.com/FrameworkSeguridadTypes">
   <soapenv:Header/>
   <soapenv:Body>
      <fram:LoginAplicacion_in>
         <fram:LoginAplicacion_in>
            <!--<fram:IdAplicacion>36</fram:IdAplicacion> -->
            <!--<fram:Usuario>apl_vdt</fram:Usuario> -->
            <fram:IdAplicacion>453</fram:IdAplicacion>
            <fram:Usuario>apl_csp</fram:Usuario>
            <!--Optional:-->
            <fram:HorasExpiracion>?</fram:HorasExpiracion>
         </fram:LoginAplicacion_in>
      </fram:LoginAplicacion_in>
   </soapenv:Body>
</soapenv:Envelope>